<!-- dflook/terraform-github-actions {"workspace":"fix-root-tool-versions-2","backend_type":"remote","backend":"c0239e56fc211f710996c6b57b5a10c060dac6beaf00c19e5a779894db8bd5f7","plan_job_ref":"Job Test Terraform cloud #225 at https://github.com/dflook/terraform-github-actions/actions/runs/7555582520","plan_hash":"50a31c2a066069fed0a52ee86c066e0926483843ba41cb3426a74aa4906a4e3c","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __fix-root-tool-versions-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #225](https://github.com/dflook/terraform-github-actions/actions/runs/7555582520)